Tekla Open API Reference for Tekla Structures 2025
WpfShapeCatalog Constructor (String)
 Initializes a new instance of the ShapeCatalog class and will select the Shape (if available) in the tree.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public WpfShapeCatalog(
	string shape
)
Public Sub New (
	shape As String
)
Parameters
shape
Type: System.String
The Shape to be selected in the dialog.
See Also
Reference
WpfShapeCatalog Class
WpfShapeCatalog Overload
Tekla.Structures.Dialog.UIControls Namespace